AzureActivity
| where ResourceProvider == "Microsoft.Compute"
    and OperationName contains "virtualMachines/write"
    and ActivityStatus == "Succeeded"
| extend parsed = parse_json(Properties)
| project 
    TimeGenerated,
    Caller,
    ResourceId,
    OperationName,
    ActivityStatus,
    Authorization,
    CallerIpAddress
| order by TimeGenerated desc



AzureActivity
| where ResourceProvider == "Microsoft.Compute"
| where OperationName contains "virtualMachines/write"
| where ActivityStatus == "Succeeded"
| where ResourceId contains "<your-vm-name>"
| project TimeGenerated, Caller, CallerIpAddress, OperationName, Properties, Authorization
